{
  "<unk>": 0,
  " ": 1,
  "!": 2,
  "\"": 3,
  "#": 4,
  "$": 5,
  "%": 6,
  "&": 7,
  "'": 8,
  "(": 9,
  ")": 10,
  "*": 11,
  "+": 12,
  ",": 13,
  "-": 14,
  ".": 15,
  "/": 16,
  "0": 17,
  "1": 18,
  "2": 19,
  "3": 20,
  "4": 21,
  "5": 22,
  "6": 23,
  "7": 24,
  "8": 25,
  "9": 26,
  ":": 27,
  ";": 28,
  "<": 29,
  "=": 30,
  ">": 31,
  "?": 32,
  "@": 33,
  "A": 34,
  "B": 35,
  "C": 36,
  "D": 37,
  "E": 38,
  "F": 39,
  "G": 40,
  "H": 41,
  "I": 42,
  "J": 43,
  "K": 44,
  "L": 45,
  "M": 46,
  "N": 47,
  "O": 48,
  "P": 49,
  "Q": 50,
  "R": 51,
  "S": 52,
  "T": 53,
  "U": 54,
  "V": 55,
  "W": 56,
  "X": 57,
  "Y": 58,
  "Z": 59,
  "[": 60,
  "\\": 61,
  "]": 62,
  "^": 63,
  "_": 64,
  "`": 65,
  "a": 66,
  "b": 67,
  "c": 68,
  "d": 69,
  "e": 70,
  "f": 71,
  "g": 72,
  "h": 73,
  "i": 74,
  "j": 75,
  "k": 76,
  "l": 77,
  "m": 78,
  "n": 79,
  "o": 80,
  "p": 81,
  "q": 82,
  "r": 83,
  "s": 84,
  "t": 85,
  "u": 86,
  "v": 87,
  "w": 88,
  "x": 89,
  "y": 90,
  "z": 91,
  "{": 92,
  "|": 93,
  "}": 94,
  "~": 95,
  "ក": 96,
  "ខ": 97,
  "គ": 98,
  "ឃ": 99,
  "ង": 100,
  "ច": 101,
  "ឆ": 102,
  "ជ": 103,
  "ឈ": 104,
  "ញ": 105,
  "ដ": 106,
  "ឋ": 107,
  "ឌ": 108,
  "ឍ": 109,
  "ណ": 110,
  "ត": 111,
  "ថ": 112,
  "ទ": 113,
  "ធ": 114,
  "ន": 115,
  "ប": 116,
  "ផ": 117,
  "ព": 118,
  "ភ": 119,
  "ម": 120,
  "យ": 121,
  "រ": 122,
  "ល": 123,
  "វ": 124,
  "ឝ": 125,
  "ឞ": 126,
  "ស": 127,
  "ហ": 128,
  "ឡ": 129,
  "អ": 130,
  "ឣ": 131,
  "ឥ": 132,
  "ឦ": 133,
  "ឧ": 134,
  "ឩ": 135,
  "ឪ": 136,
  "ឫ": 137,
  "ឬ": 138,
  "ឭ": 139,
  "ឮ": 140,
  "ឯ": 141,
  "ឰ": 142,
  "ឱ": 143,
  "ឲ": 144,
  "ឳ": 145,
  "ា": 146,
  "ិ": 147,
  "ី": 148,
  "ឹ": 149,
  "ឺ": 150,
  "ុ": 151,
  "ូ": 152,
  "ួ": 153,
  "ើ": 154,
  "ឿ": 155,
  "ៀ": 156,
  "េ": 157,
  "ែ": 158,
  "ៃ": 159,
  "ោ": 160,
  "ៅ": 161,
  "ំ": 162,
  "ះ": 163,
  "ៈ": 164,
  "៉": 165,
  "៊": 166,
  "់": 167,
  "៌": 168,
  "៍": 169,
  "៎": 170,
  "៏": 171,
  "័": 172,
  "៑": 173,
  "្": 174,
  "។": 175,
  "៕": 176,
  "៖": 177,
  "ៗ": 178,
  "៘": 179,
  "៙": 180,
  "៚": 181,
  "៛": 182,
  "០": 183,
  "១": 184,
  "២": 185,
  "៣": 186,
  "៤": 187,
  "៥": 188,
  "៦": 189,
  "៧": 190,
  "៨": 191,
  "៩": 192,
  "​": 193,
  "–": 194,
  "—": 195,
  "“": 196,
  "”": 197,
  "←": 198,
  "→": 199
}